ankur/assignment/association_m2m/ocp/app/controllers/groups_controller.rb

  def index
  	@groups = Group.all
  	@users = User.all
---
SELECT `groups`.* FROM `groups`
SELECT `users`.* FROM `users`

  def create
  	@group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`created_at`, `name`, `updated_at`) VALUES ('2012-09-11 09:56:58', 'Neev Newbies', '2012-09-11 09:56:58')

  def show
  	@group = Group.find(params[:id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1