ankur/assignment/association_m2m/ocp/app/controllers/users_controller.rb

  def index
    @users = User.all
    @groups = Group.all
---
SELECT `users`.* FROM `users`
SELECT `groups`.* FROM `groups`

  def create
    @user = User.find_by_name(params[:user][:name])
    @user = User.new(params[:user]) if !@user.present?
    group = Group.find(params[:name])
    @user.groups << group
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'Nikhil Sharma' LIMIT 1
SELECT 1 AS one FROM `users` WHERE `users`.`name` = BINARY 'Nikhil Sharma' LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
INSERT INTO `users` (`age`, `created_at`, `email`, `name`, `updated_at`) VALUES (23, '2012-09-11 07:34:18', 'ankur@neevtech.com', 'Ankur Omer', '2012-09-11 07:34:18')
SELECT `groups`.* FROM `groups`

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `age` = 25, `updated_at` = '2012-09-11 07:44:39' WHERE `users`.`id` = 1