ankur/assignment/association_m2m/ocp/app/views/users/_form.html.erb

    <%= label_tag "Groups" %><br />
    <%= select :group, :name, options_from_collection_for_select(Group.all, "id", "name"), prompt: "--Select--" %>
---
SELECT `groups`.* FROM `groups`